app/controllers/api/user_auths_controller.rb

  def user_sign_in
    if request.format != :json
      render :status=>406, :json=>{:status=>"Failure",:message=>"The request must be json"}
      return
    end
    email = params[:email]
    password = params[:password]
    if email.nil? or password.nil?
      render :status=>400,:json=>{:status=>"Failure",:message=>"The request must contain the email and password."}
      return
    end
    @user = User.find_by_email(email.downcase)
---
SELECT  `users`.* FROM `users` WHERE `users`.`email` = 'vishal@gmail.com' LIMIT 1

  def company_profile
  	all_company_type = Company.all
---
SELECT `companies`.* FROM `companies`

  def branch_list
  	all_branch_list = Branch.all
---
SELECT `branches`.* FROM `branches`

  def create_employee1
    code = params[:code]
    prefix = params[:prefix]
    first_name = params[:first_name]
    middle_name = params[:middle_name]
    last_name = params[:last_name]
    gender = params[:gender]
    email = params[:email]
    contact_no = params[:contact_no]
    blood_group = params[:blood_group]
    date_of_birth = params[:date_of_birth]
    address = params[:address]
    pin_code = params[:pin_code]
    country = params[:county]
    state = params[:state]
    district = params[:district]
    city= params[:city]
    adhar_no = params[:adhar_no]
    status = params[:status]
    company_id = params[:company_id]
    branch_id = params[:branch_id]
    @employee1 = Employee.create(code: code,prefix: prefix, first_name: first_name, middle_name: middle_name, last_name: last_name, gender: gender, email: email,
     contact_no: contact_no,blood_group: blood_group,date_of_birth: date_of_birth, address: address, pin_code: pin_code, country: country,state: state,
     district: district, city: city,adhar_no: adhar_no,status: status, company_id: company_id, branch_id: branch_id)
---
INSERT INTO `employees` (`code`, `prefix`, `first_name`, `middle_name`, `last_name`, `gender`, `contact_no`, `email`, `blood_group`, `address`, `country`, `state`, `district`, `city`, `pin_code`, `adhar_no`, `status`, `created_at`, `updated_at`) VALUES ('undefined', 'Mr', 'undefined', 'undefined', 'undefined', 'Male', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', 0, 'undefined', TRUE, '2018-06-27 04:38:56', '2018-06-27 04:38:56')

  def create_enquiry
    mobile_no = params[:mobile_no]
    name_first = params[:first_name]
    middle_name = params[:middle_name]
    last_name = params[:last_name]
    email = params[:email]
    address = params[:address]
    place = params[:place]
    user_id = params[:user_id]
    date = params[:date]
    scheme_id = params[:scheme_id]
    description = params[:description]
    @enquiry = Enquiry.create(mobile_no: mobile_no, name_first: name_first, middle_name: middle_name, last_name: last_name,  email: email,address: address, place: place, user_id: user_id, enquiry_date: date, scheme_id: scheme_id, description: description, status: true)
---
INSERT INTO `enquiries` (`mobile_no`, `name_first`, `middle_name`, `last_name`, `email`, `address`, `place`, `created_at`, `updated_at`) VALUES ('8976543210', 'priya', 'undefined', 'verma', 'priya@gmail.com', 'pune', 'pune', '2018-06-26 09:18:39', '2018-06-26 09:18:39')

   def create_scheme
    scheme_type = params[:scheme_type]
    name = params[:name]
    budget = params[:budget]
    down_payment = params[:down_payment]
    installment = params[:installment]
    installment_amount = params[:installment_amount]
    intrest = params[:intrest]
    from_date = params[:from_date]
    to_date = params[:to_date]
    status = params[:status]
    @scheme = Scheme.create(scheme_type: scheme_type, name: name, budget: budget, down_payment: down_payment, installment: installment, installment_amount: installment_amount, intrest: intrest, from_date: from_date)
---
INSERT INTO `schemes` (`name`, `budget`, `down_payment`, `intrest`, `from_date`, `created_at`, `updated_at`, `installment_amount`, `scheme_type`, `installment`) VALUES ('abc', 5000, '300', 56, '2018-06-26', '2018-06-26 11:46:04', '2018-06-26 11:46:04', 56, '1', '567')

  def enquiry_list
  	all_enquiry_list = Enquiry.all
    render :json => all_enquiry_list.present? ? all_enquiry_list.collect{|d| {:id => d.try(:id),:mobile_no => d.try(:mobile_no), :name_first => d.try(:name_first), :middle_name => d.try(:middle_name), :last_name => d.try(:last_name), :place => d.try(:place), :address => d.try(:address), :email => d.try(:email), :user_id => d.try(:user_id), :scheme_id => d.try(:scheme_id), :scheme_name => d.try(:scheme).try(:name), :enquiry_date => d.try(:enquiry_date), :description => d.try(:description) }} : []
---
SELECT `enquiries`.* FROM `enquiries`
SELECT `schemes`.* FROM `schemes`

  def schemes_list
    all_schemes_list = Scheme.where(status: true)
    render :json => all_schemes_list.present? ? all_schemes_list.collect{|d| {:id => d.try(:id),:scheme_type => d.try(:scheme_type), :name => d.try(:name), :budget => d.try(:budget), :down_payment => d.try(:down_payment), :installment => d.try(:installment), :installment_amount => d.try(:installment_amount), :intrest => d.try(:intrest), :from_date => d.try(:from_date), :to_date => d.try(:to_date), :status => d.try(:status), :vehicle_type => d.try(:vehicle_type).try(:name)}} : []
---
SELECT `schemes`.* FROM `schemes`

  def employee_list
    all_employee_list = Employee.where(status: true)
    render :json => all_employee_list.present? ? all_employee_list.collect{|d| {:id => d.try(:id),:code => d.try(:code), :prefix => d.try(:prefix), :first_name => d.try(:first_name), :middle_name => d.try(:middle_name), :last_name => d.try(:last_name), :gender => d.try(:gender), :email => d.try(:email), :contact_no => d.try(:contact_no), :blood_group => d.try(:blood_group), :date_of_birth => d.try(:date_of_birth), :address => d.try(:address), :pin_code => d.try(:pin_code), :country => d.try(:country), :state => d.try(:state), :district => d.try(:district), :adhar_no => d.try(:adhar_no), :city => d.try(:city), :status => d.try(:status), :company => d.try(:company).try(:name), :branch => d.try(:branch).try(:name) }} : []
---
SELECT `employees`.* FROM `employees`