app/controllers/branches_controller.rb

  def index
    @branches = Branch.all
---
SELECT `branches`.* FROM `branches`

  def create
    @branch = Branch.new(branch_params)

    respond_to do |format|
      if @branch.save
---
INSERT INTO `branches` (`code`, `name`, `address`, `email`, `contact_no`, `status`, `created_at`, `updated_at`) VALUES ('B001', 'br_lpl', '', '', '', FALSE, '2018-06-25 11:26:40', '2018-06-25 11:26:40')

    def set_branch
      @branch = Branch.find(params[:id])
---
SELECT  `branches`.* FROM `branches` WHERE `branches`.`id` = 1 LIMIT 1