app/controllers/companies_controller.rb

  def index
    @companies = Company.all
---
SELECT `companies`.* FROM `companies`

  def create
    @company = Company.new(company_params)

    respond_to do |format|
      if @company.save
---
INSERT INTO `companies` (`code`, `name`, `address`, `country`, `state`, `district`, `city`, `pin_code`, `email`, `contact_no`, `status`, `created_at`, `updated_at`) VALUES ('C001', 'Lusaka', 'Lusaka', 'Zambia', 'Lusaka', '', 'Lusaka', 123456, 'lusaka@gmail.com', 'CL001', FALSE, '2018-06-25 11:19:09', '2018-06-25 11:19:09')

    def set_company
      @company = Company.find(params[:id])
---
SELECT  `companies`.* FROM `companies` WHERE `companies`.`id` = 1 LIMIT 1