app/controllers/employees_controller.rb

SELECT `employees`.* FROM `employees`
---
  def index
    @employees = Employee.all