app/controllers/enquiries_controller.rb

SELECT `enquiries`.* FROM `enquiries`
---
  def index
    @enquiries = Enquiry.all

INSERT INTO `enquiries` (`mobile_no`, `name_first`, `middle_name`, `last_name`, `email`, `address`, `place`, `created_at`, `updated_at`) VALUES ('1234567890', 'Santosh', 'Sadashiv', 'Kumbhar', 'san@gmail.com', 'pune', '4517234', '2018-06-27 11:08:23', '2018-06-27 11:08:23')
---
  def create
    @enquiry = Enquiry.new(enquiry_params)

    respond_to do |format|
      if @enquiry.save

SELECT  `enquiries`.* FROM `enquiries` WHERE `enquiries`.`id` = 1 LIMIT 1
---
  def show_enquiry
    @enquiry = Enquiry.find(params[:enquiry_id])

SELECT  `enquiries`.* FROM `enquiries` WHERE `enquiries`.`id` = 1 LIMIT 1
---
    def set_enquiry
      @enquiry = Enquiry.find(params[:id])