app/controllers/schemes_controller.rb

SELECT `schemes`.* FROM `schemes`
---
  def index
    @schemes = Scheme.all

INSERT INTO `schemes` (`type`, `name`, `down_payment`, `from_date`, `to_date`, `status`, `created_at`, `updated_at`) VALUES ('', '', '', '2018-06-26', '2018-06-26', FALSE, '2018-06-26 10:42:56', '2018-06-26 10:42:56')
---
  def create
    @scheme = Scheme.new(scheme_params)

    respond_to do |format|
      if @scheme.save

SELECT  `schemes`.* FROM `schemes` WHERE `schemes`.`id` = 1 LIMIT 1
---
    def set_scheme
      @scheme = Scheme.find(params[:id])